{"_id":{"$oid":"64e8106d5df6228dd33d54d0"},"Title":"The Godfather","Description":"Michael, the young and idealistic son of Vito Corleone, the head of the most powerful Mafia clan in Ner York, returns home as a war hero and is determined to live his own life. But tragic circumstances make him face the legacy of his family.","Director":{"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola is an American film director, producer, and screenwriter. He is considered one of the major figures of the New Hollywood filmmaking movement of the 1960s and 1970s.","Birth":"1939","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/1/1c/Godfather_ver1.jpg","Release":"1972","Featured":false,"Genre":{"Name":"Crime","Description":"Crime film is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."}}
{"_id":{"$oid":"64e816d05df6228dd33d54d1"},"Title":"The Shawshank Redemption","Description":"After the murder of his wife, hotshot banker Andrew Dufresne is sent to Shawshank Prison. Over the years, he retains hope and eventually gains the respect of his fellow inmates and achieves his ends on his own terms.","Director":{"Name":"Frank Darabont","Bio":"Frank Darabont is a French-born American film director, screenwriter, and producer. He has been nominated for three Academy Awards and a Golden Globe Award.","Birth":"1959","Death":"N/A"},"Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/81/ShawshankRedemptionMoviePoster.jpg","Release":"1994","Featured":false}
{"_id":{"$oid":"64e81e985df6228dd33d54d3"},"Title":"Blade Runner","Description":"In the near future, the police department forces former blade runner Rick Deckard out of retirement to hunt four genetically engineered humans who have escaped the colonies and returned to Earth.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena of that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, interstellar travel, time travel, or other technologies."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridely Scott is a British filmmaker. He is known for directing films in the science fiction, crime, and historical drama genres.","Birth":"1937","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/9/9f/Blade_Runner_%281982_poster%29.png","Release":"1982","Featured":false}
{"_id":{"$oid":"64e8f8c75df6228dd33d54d5"},"Title":"Eternal Sunshine Of The Spotless Mind","Description":"Joel Barish is shocked to discover that the love of his life, Clementine, has had erased from her memory. As a result, hurt and angry, Joel wants to pay her back in the same coin, going as far as to undergo a painless but intricate medical procedure to do the same. And as the once-cherished recollections of Clementine gradually fade away, giving away to a soulless black void, something happens. Now Joel has second thoughts, toying with the idea of stopping the irreversible process.","Genre":{"Name":"Romance","Description":"Romance films involve romantic love stories recorded in visual media for broadcast in theatres or on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters."},"Director":{"Name":"Michel Gondry","Bio":"Michel Gondry is a French filmmaker noted for his inventive visual style. He won an Academy Award for Best Original Screenplay as one of the writers of the 2004 film Eternal Sunshine of the Spotless Mind, which he also directed.","Birth":"1963","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/a/a4/Eternal_Sunshine_of_the_Spotless_Mind.png","Release":"2004","Featured":false}
{"_id":{"$oid":"64e81b6a5df6228dd33d54d2"},"Title":"Pulp Fiction","Description":"The lives of two hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Crime film is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, producer, actor, and author.","Birth":"1963","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/3/3b/Pulp_Fiction_%281994%29_poster.jpg","Release":"1994","Featured":false}
{"_id":{"$oid":"64e9013f5df6228dd33d54d7"},"Title":"Forrest Gump","Description":"The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man:Forrest Gump with an IQ of 75, who yearns to be reunited with his childhood sweetheart.","Genre":{"Name":"Drama","Description":"in the film and television, drama is a category of genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of the action-adventure romantic comedy 'Romancing the Stone' (1984), the science-fiction comedy 'Back to the Future' film trilogy (1985-1999), and the live-action/animated comedy 'Who Framed Roger Rabbit' (1988).","Birth":"1952","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/6/67/Forrest_Gump_poster.jpg","Release":"1994","Featured":false}
{"_id":{"$oid":"64ea1b615df6228dd33d54e0"},"Title":"Back to the Future","Description":"Marty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist, Doc Brown.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, interstellar travel, time travel, or other technologies."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of the action-adventure romantic comedy 'Romancing the Stone' (1984), the science-fiction comedy 'Back to the Future' film trilogy (1985-1990), and the live-action/animated comedy 'Who Framed Roger Rabbit' (1988).","Birth":"1952","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/d/d2/Back_to_the_Future.jpg","Release":"1985","Featured":false}
{"_id":{"$oid":"64e909725df6228dd33d54d8"},"Title":"Taxi Driver","Description":"Travis Bickle is an ex-Marine and Vietnam War veteran living tn New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night. For him, the one bright spot in humanity is Besty, a worker on the presidential nomination campaign of Senator Charles palantine. After an incident, he believes he has to do whatever he needs to make the world a better place.","Genre":{"Name":"Thriller","Description":"These movies delve into the human mind, exploring fear, paranoia, manipulation, and the complexity of human psychology. The genre challenges viewers intellectually and emotionally, playing with their expectations and keeping them engaged with intricate plots, mind-bending twists, and morally ambiguous characters."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Charlse Scorsese is an American and Italian film director, producer, screenwriter and actor. Scorsese emerged as one of the major figures of th New Hollywood era.","Birth":"1942","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/3/33/Taxi_Driver_%281976_film_poster%29.jpg","Release":"1976","Featured":false}
{"_id":{"$oid":"64e8fe4e5df6228dd33d54d6"},"Title":"The Silence Of The Lambs","Decripton":"Young F.B.I trainee Clarice Starling is assigned to help find a missing woman to save her from a psychopathic serial killer. Clarice attempts to gain a better insight into the twisted mind of the killer by talking to another psychopath: Dr. Hannibal Lecter, who used to be a respected psychiatrist. However, Clarice must first gain Lecter's confidence before the inmate will give away any information.","Genre":{"Name":"Thriller","Description":"These movies delve into the human mind, exploring fear, paranoia, manipulation, and the complexity of human psychology. The genre challenges viewers intellectually and emotionally, playing with their expectations and keeping them engaged with intricate plots, mind-bending twists, and morally ambiguous characters."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American film director, producer and creenwriter. Beginning his career under B-movie producer Roger Corman, Demme made his directorial debut with the 1974 women-in-prison film 'Caged Heat'.","Birth":"1944","Death":"2017"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/86/The_Silence_of_the_Lambs_poster.jpg","Release":"1991","Featured":false}
{"_id":{"$oid":"64e80dca5df6228dd33d54cf"},"Title":"2001: A Space Odyssey","Description":"After uncovering a mysterious artifact buried beneath the Lunar surface, a spacecraft is sent to Jupiter to find its origins: a spacecraft manned by two men and the supercomputer HAL 9000.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robot, interstellar travel, time travel, or other technologies."},"Director":{"Name":"Stanley Kubrick","Bio":"Stanley Kubrick was an American film director, producer, screenwriter, and photographer.","Birth":"1928","Death":"1999"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/1/11/2001_A_Space_Odyssey_%281968%29.png","Release":"1968","Featured":true}
